# 3. DataFrame
* 2차원 행렬 데이터에 행 인덱스, 열 인덱스를 붙인 것, 엑셀의 Sheet와 유사
* DataFrame = 2차원 배열의 값(value) + 행 인덱스 (row index) + 열 인덱스(column index)
* Numpy의 2차원 배열은 동일한 자료형을 가져야 하지만, DataFrame은 열마다 자료형이 다를 수 있음

## 3-1. DataFrame 생성하기

In [1]:
import pandas as pd
import numpy as np

In [2]:
# 1.value값만 주기
data = [['삼성',2000,'스마트폰'],['LG',1000,'가전제품'],['네이버',500,'포털']]
d=pd.DataFrame(data)
d

     0     1     2
0   삼성  2000  스마트폰
1   LG  1000  가전제품
2  네이버   500    포털

In [3]:
type(d)

pandas.core.frame.DataFrame

In [4]:
d.shape

(3, 3)

In [5]:
# 행 index
d.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
# 열 index
d.columns

RangeIndex(start=0, stop=3, step=1)

In [7]:
# value 속성
d.values

array([['삼성', 2000, '스마트폰'],
       ['LG', 1000, '가전제품'],
       ['네이버', 500, '포털']], dtype=object)

In [8]:
type(d.values)

numpy.ndarray

In [9]:
d.head(2)

    0     1     2
0  삼성  2000  스마트폰
1  LG  1000  가전제품

In [10]:
d.tail(2)

     0     1     2
1   LG  1000  가전제품
2  네이버   500    포털

In [11]:
a = np.array([1,2,'3'])
a

array(['1', '2', '3'], dtype='<U21')

In [12]:
d

     0     1     2
0   삼성  2000  스마트폰
1   LG  1000  가전제품
2  네이버   500    포털

In [13]:
# DataFrame 의 데이터 구조 보기
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      object
 1   1       3 non-null      int64
 2   2       3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [14]:
# 컬럼에 대한 요약 통계값
d.describe()

                 1
count     3.000000
mean   1166.666667
std     763.762616
min     500.000000
25%     750.000000
50%    1000.000000
75%    1500.000000
max    2000.000000

In [15]:
# 4분위수 : (Quartile) : 통계값 중의 하나, 데이터의 분포를 작은 수부터 큰 수까지 나열하여 4등분한 지점 (25%씩 동등 분할한 지점)
# cf) Quartile : 주어진 데이터를 동등하게 분할한 지점
# Q1(25%), Q2(50%), Q3(75%),Q4(100%)
d.median()

1    1000.0
dtype: float64

In [16]:
# 2. value값과 index 둘 다 주기
index = [1,2,3] # 행 인덱스
columns = ['기업명', '주가','업종'] # 열 인덱스
data = [['삼성',2000,'스마트폰'],['LG',1000,'가전제품'],['네이버',500,'포털']]
d = pd.DataFrame(data=data,index=index,columns=columns)
d

   기업명    주가    업종
1   삼성  2000  스마트폰
2   LG  1000  가전제품
3  네이버   500    포털

In [17]:
# 3. 딕셔너리 형태로 주기
data = {
    '기업명' : ['삼성','LG','네이버'],
    '주가' : [2000,1000,500],
    '업종' : ['스마트폰','가전제품','포털']
}
d2 = pd.DataFrame(data=data)
d2

   기업명    주가    업종
0   삼성  2000  스마트폰
1   LG  1000  가전제품
2  네이버   500    포털

In [18]:
d2.index.name = '순서'
d2

    기업명    주가    업종
순서
0    삼성  2000  스마트폰
1    LG  1000  가전제품
2   네이버   500    포털

In [19]:
d2.columns.name='업종'
d2

업종  기업명    주가    업종
순서
0    삼성  2000  스마트폰
1    LG  1000  가전제품
2   네이버   500    포털

In [20]:
d2.columns.name='항목'
d2

항목  기업명    주가    업종
순서
0    삼성  2000  스마트폰
1    LG  1000  가전제품
2   네이버   500    포털

## 3-2. DataFrame 인덱싱과 슬라이싱

In [21]:
# 열 인덱싱
d['기업명']

1     삼성
2     LG
3    네이버
Name: 기업명, dtype: object

In [22]:
d.기업명

1     삼성
2     LG
3    네이버
Name: 기업명, dtype: object

In [23]:
# 여러개의 열을 인덱싱하기 (Fancy Indexing)
b = d[['기업명','업종']]
b

   기업명    업종
1   삼성  스마트폰
2   LG  가전제품
3  네이버    포털

In [24]:
type(b)

pandas.core.frame.DataFrame

In [25]:
# 하나의 열만 인덱싱하여 DataFrame 만들기 (기업명)
d[['기업명']]

   기업명
1   삼성
2   LG
3  네이버

In [26]:
type(d)

pandas.core.frame.DataFrame

In [27]:
d

   기업명    주가    업종
1   삼성  2000  스마트폰
2   LG  1000  가전제품
3  네이버   500    포털

In [28]:
# 기업명 -> 행인덱스, 주가와 업종으로 이루어진 DataFrame
d.index = d['기업명']
d

     기업명    주가    업종
기업명
삼성    삼성  2000  스마트폰
LG    LG  1000  가전제품
네이버  네이버   500    포털

In [29]:
del d['기업명']
d

       주가    업종
기업명
삼성   2000  스마트폰
LG   1000  가전제품
네이버   500    포털

In [30]:
# 컬럼 추가 (발행 주식 수)
d['발행주식수'] = [30000,20000,10000]
d

       주가    업종  발행주식수
기업명
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000
네이버   500    포털  10000

In [31]:
# 행 인덱싱(삼성)
# 1. loc(label location) : 행 인덱스 라벨을 기준으로 행 인덱싱
a=d.loc['삼성']
a

주가        2000
업종        스마트폰
발행주식수    30000
Name: 삼성, dtype: object

In [32]:
type(a)

pandas.core.series.Series

In [33]:
d.loc[['삼성','네이버']]

       주가    업종  발행주식수
기업명
삼성   2000  스마트폰  30000
네이버   500    포털  10000

In [34]:
# 2. iloc (integer location) : 0 인덱스를 기준으로 행 인덱싱
d.iloc[0]

주가        2000
업종        스마트폰
발행주식수    30000
Name: 삼성, dtype: object

In [35]:
d.iloc[-1]

주가         500
업종          포털
발행주식수    10000
Name: 네이버, dtype: object

In [36]:
d.iloc[[0,-1]]

       주가    업종  발행주식수
기업명
삼성   2000  스마트폰  30000
네이버   500    포털  10000

In [37]:
d

       주가    업종  발행주식수
기업명
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000
네이버   500    포털  10000

In [38]:
# 열 인덱싱 -> 행 인덱싱
d['업종']

기업명
삼성     스마트폰
LG     가전제품
네이버      포털
Name: 업종, dtype: object

In [39]:
d['업종']['삼성']

'스마트폰'

In [40]:
d.loc['삼성']

주가        2000
업종        스마트폰
발행주식수    30000
Name: 삼성, dtype: object

In [41]:
d.loc['삼성']['업종']

'스마트폰'

In [42]:
d.loc['삼성','업종'] # 더 많이 씀

'스마트폰'

In [43]:
d.iloc[0,1]

'스마트폰'

In [44]:
# 슬라이싱
d

       주가    업종  발행주식수
기업명
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000
네이버   500    포털  10000

In [45]:
# 행 슬라이싱 (start:end:step)
d[:2]

       주가    업종  발행주식수
기업명
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000

In [46]:
d[1:]

       주가    업종  발행주식수
기업명
LG   1000  가전제품  20000
네이버   500    포털  10000

In [47]:
d[1:2]

       주가    업종  발행주식수
기업명
LG   1000  가전제품  20000

In [48]:
d

       주가    업종  발행주식수
기업명
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000
네이버   500    포털  10000

In [49]:
d['LG':'LG']

       주가    업종  발행주식수
기업명
LG   1000  가전제품  20000

In [50]:
# 열 슬라이싱
d[d.columns[:2]]

       주가    업종
기업명
삼성   2000  스마트폰
LG   1000  가전제품
네이버   500    포털

In [51]:
# Boolean 인덱싱
d

       주가    업종  발행주식수
기업명
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000
네이버   500    포털  10000

In [52]:
d['발행주식수'] >=15000

기업명
삼성      True
LG      True
네이버    False
Name: 발행주식수, dtype: bool

In [53]:
d[d['발행주식수']>=15000]

       주가    업종  발행주식수
기업명
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000

In [54]:
d.loc['삼성':'LG']

       주가    업종  발행주식수
기업명
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000

## 3-3. DataFrame 데이터 CRUD

In [55]:
# 행 추가
#d = d.append(# 행 추가
#d = d.append({'주가' : 1500, '업종': 'IT', '발행주식수' : 15000}, ignore_index = True)
#d

In [56]:
d

       주가    업종  발행주식수
기업명
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000
네이버   500    포털  10000

In [57]:
data2 = {'주가' : 1500, '업종': 'IT', '발행주식수' : 15000}
index2 = ['카카오']
d2 = pd.DataFrame(data=data2,index=index2)
d2

       주가  업종  발행주식수
카카오  1500  IT  15000

In [58]:
#행 추가1
d = d.append(d2)
d

       주가    업종  발행주식수
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000
네이버   500    포털  10000
카카오  1500    IT  15000

In [59]:
# 행 추가 2
d = pd.concat([d,d2])
d

       주가    업종  발행주식수
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000
네이버   500    포털  10000
카카오  1500    IT  15000
카카오  1500    IT  15000

In [60]:
s = pd.Series(data=data2)
s

주가        1500
업종          IT
발행주식수    15000
dtype: object

In [61]:
s.name='카카오'
s

주가        1500
업종          IT
발행주식수    15000
Name: 카카오, dtype: object

In [62]:
d.append(s)

       주가    업종  발행주식수
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000
네이버   500    포털  10000
카카오  1500    IT  15000
카카오  1500    IT  15000
카카오  1500    IT  15000

In [63]:
#행 추가 4
d.loc['현대']=[1700,'자동차',18000]
d

       주가    업종  발행주식수
삼성   2000  스마트폰  30000
LG   1000  가전제품  20000
네이버   500    포털  10000
카카오  1500    IT  15000
카카오  1500    IT  15000
현대   1700   자동차  18000

In [64]:
# 열 추가
d['시가총액'] = d['주가'] * d['발행주식수']
d

       주가    업종  발행주식수      시가총액
삼성   2000  스마트폰  30000  60000000
LG   1000  가전제품  20000  20000000
네이버   500    포털  10000   5000000
카카오  1500    IT  15000  22500000
카카오  1500    IT  15000  22500000
현대   1700   자동차  18000  30600000

In [65]:
d.loc['네이버']=[1000,'IT서비스업',15000,1000 * 15000]
d

       주가      업종  발행주식수      시가총액
삼성   2000    스마트폰  30000  60000000
LG   1000    가전제품  20000  20000000
네이버  1000  IT서비스업  15000  15000000
카카오  1500      IT  15000  22500000
카카오  1500      IT  15000  22500000
현대   1700     자동차  18000  30600000

In [66]:
# 전체 열 데이터 변경
d['주가'] += 500
d

       주가      업종  발행주식수      시가총액
삼성   2500    스마트폰  30000  60000000
LG   1500    가전제품  20000  20000000
네이버  1500  IT서비스업  15000  15000000
카카오  2000      IT  15000  22500000
카카오  2000      IT  15000  22500000
현대   2200     자동차  18000  30600000

In [67]:
d.loc['현대','업종'] = '전기자동차'
d

       주가      업종  발행주식수      시가총액
삼성   2500    스마트폰  30000  60000000
LG   1500    가전제품  20000  20000000
네이버  1500  IT서비스업  15000  15000000
카카오  2000      IT  15000  22500000
카카오  2000      IT  15000  22500000
현대   2200   전기자동차  18000  30600000

In [68]:
d=d.drop('카카오')
d

       주가      업종  발행주식수      시가총액
삼성   2500    스마트폰  30000  60000000
LG   1500    가전제품  20000  20000000
네이버  1500  IT서비스업  15000  15000000
현대   2200   전기자동차  18000  30600000

In [69]:
d = d.drop(index='현대') #['현대','네이버']
d

       주가      업종  발행주식수      시가총액
삼성   2500    스마트폰  30000  60000000
LG   1500    가전제품  20000  20000000
네이버  1500  IT서비스업  15000  15000000

In [70]:
d = d.drop('시가총액',axis=1)
d

       주가      업종  발행주식수
삼성   2500    스마트폰  30000
LG   1500    가전제품  20000
네이버  1500  IT서비스업  15000

In [71]:
d = d.drop(columns='발행주식수')
d

       주가      업종
삼성   2500    스마트폰
LG   1500    가전제품
네이버  1500  IT서비스업

# 3-4. DataFrame 연산

In [72]:
# DataFrame 간의 연산
d2 = d.copy()
d2

       주가      업종
삼성   2500    스마트폰
LG   1500    가전제품
네이버  1500  IT서비스업

In [73]:
id(d),id(d2)

(140471973066928, 140471972997824)

In [74]:
d + d2

       주가            업종
삼성   5000      스마트폰스마트폰
LG   3000      가전제품가전제품
네이버  3000  IT서비스업IT서비스업

In [75]:
'스마트폰'+'스마트폰'

'스마트폰스마트폰'

In [77]:
d['주가'] - d2['주가']

삼성     0
LG     0
네이버    0
Name: 주가, dtype: int64

In [78]:
d.append(d2)

       주가      업종
삼성   2500    스마트폰
LG   1500    가전제품
네이버  1500  IT서비스업
삼성   2500    스마트폰
LG   1500    가전제품
네이버  1500  IT서비스업

In [79]:
pd.concat([d,d2])

       주가      업종
삼성   2500    스마트폰
LG   1500    가전제품
네이버  1500  IT서비스업
삼성   2500    스마트폰
LG   1500    가전제품
네이버  1500  IT서비스업

In [80]:
# Aggregation 함수
d

       주가      업종
삼성   2500    스마트폰
LG   1500    가전제품
네이버  1500  IT서비스업

In [81]:
d.min()

주가      1500
업종    IT서비스업
dtype: object

In [82]:
d.max()

주가    2500
업종    스마트폰
dtype: object